# vim:fileencoding=utf-8:ft=conf

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "bash"
brew "coreutils" # cat, ls, rm
brew "curl"
brew "git"
brew "stow"
brew "tmux"
brew "openssl"
brew "fish"
brew "fisher"
brew "wget"

# Nvim related
brew "neovim"
brew "tree-sitter"
# brew "luajit", args: ["HEAD"] # no bottle for Apple Silicon

brew "exa" # improved ls with color
brew "fasd" #

brew "ripgrep"
brew "fzf"

brew "fd" # better find
brew "jq" # jq json processor
brew "mas" # mac app store command line

# CLIs, Dev tools
brew "libpq" # postgre cli
brew "pgcli"
brew "gh" # github cli
cask "github"
brew "awscli"
cask "docker"
brew "golang-migrate"

brew "direnv"
cask "ngrok"

cask "kitty"
cask "visual-studio-code"
cask "font-hack-nerd-font" # Add nerd font

# language setup
brew "yarn", args: ["ignore-dependencies"]
brew "fnm" # node version manager

cask "vlc"
cask "slack"
cask "discord"
cask "zoom"
cask "google-chrome"
cask "google-drive"
cask "notion"
cask "obsidian"

cask "messenger"

cask "kap"

# Design Tool
cask "inkscape"
cask "figma"
cask "darktable"
# cask "digikam" # todo: manage photo
cask "handbrake"

# Should install
cask "1password"
cask "1password-cli"
# cask "firefox"
# cask "firefox-developer-edition"

# Keybinding
cask "hammerspoon"
cask "karabiner-elements"

# Stuff
cask "brave-browser"
cask "qbittorrent"

# Games
cask "steam" # new age, no more dota 2 for now

cask "adobe-acrobat-reader"
cask "android-studio"

cask "canva"

# TODO: check see if homebrew host this
# a vimlike navigation for mac
# cask homerow
cask "anki"

# Should see if really needed?
# brew "autoconf"
# brew "fish"
# brew "gawk"
# brew "gnupg"

# cask "alfred"
# cask "dash"
# cask "grid-clock"
# cask "font-ia-writer-quattro"
# cask "font-ibm-plex"
# cask "font-jetbrains-mono"

# WTF is this?
# mas "Deliveries", id: 924726344
# mas "Drafts", id: 1435957248
# mas "MindNode", id: 1289197285
# mas "Reeder", id: 1529448980
# mas "Things", id: 904280696
# mas "Tweetbot", id: 1384080005

