# vim:fileencoding=utf-8:ft=conf

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# brew "coreutils" # cat, ls, rm
brew "curl"
brew "git"
brew "stow"
brew "openssl"
brew "wget"
brew "tmux"
brew "fish"

brew "exa" # improved ls with color
# brew "ripgrep"
brew "fzf" # fuzzy search
brew "bat" # smarter cat, syntax
brew "fd" # faster colorized find

# Keybinding
cask "hammerspoon"
cask "karabiner-elements"
cask "stats"

# coding
cask "kitty"
cask "visual-studio-code"
cask "font-hack-nerd-font" # Add nerd font

# language setup
brew "pnpm"
brew "fnm"

# Nvim related
brew "neovim"
# brew "tree-sitter"
# brew "luajit", args: ["HEAD"] # no bottle for Apple Silicon

# necessary
cask "raycast"

## work related
cask "slack"
cask "zoom"
cask "google-chrome"
cask "google-drive"

brew "jq" # jq json processor
# brew "mas" # mac app store command line

# CLIs, Dev tools
# brew "libpq" # postgre cli
# brew "pgcli"
# brew "gh" # github cli
# cask "github"
# brew "awscli"
cask "docker"
# brew "golang-migrate"

cask "vlc"

cask "discord"

cask "notion"
# cask "obsidian"

cask "messenger"
cask "telegram"

cask "kap"

# Design Tool
# cask "inkscape"
cask "figma"
# cask "darktable"
# cask "digikam" # todo: manage photo
cask "handbrake"

# Should install
cask "1password"
cask "1password-cli"
# cask "firefox"
# cask "firefox-developer-edition"

# Stuff
cask "brave-browser"
cask "qbittorrent"

# Games
cask "steam" # new age, no more dota 2 for now

cask "adobe-acrobat-reader"
# cask "android-studio"

cask "canva"

cask "shortcat"

cask "anki"

cask "cyberghost-vpn"
#
# Window boot
# brew "wimlib"

# Should see if really needed?
# brew "autoconf"
# brew "gawk"
# brew "gnupg"

# cask "dash"
# cask "grid-clock"
# cask "font-ia-writer-quattro"
# cask "font-ibm-plex"
# cask "font-jetbrains-mono"

# WTF is this?
# mas "Deliveries", id: 924726344
# mas "Drafts", id: 1435957248
# mas "MindNode", id: 1289197285
# mas "Reeder", id: 1529448980
# mas "Things", id: 904280696
# mas "Tweetbot", id: 1384080005

