# vim:fileencoding=utf-8:ft=conf

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "bash"
brew "coreutils" # cat, ls, rm
brew "curl"
brew "git"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "openssl"
brew "fish"
brew "fisher"

# Nvim related
brew "neovim"
brew "tree-sitter"
# brew "luajit", args: ["HEAD"] # no bottle for Apple Silicon

brew "reattach-to-user-namespace" # for tmux copy?
brew "exa" # improved ls with color
brew "fasd" #
brew "fzf"
brew "fd" # better find
brew "jq" # jq json processor
brew "mas" # mac app store command line

# CLIs
brew "gh" # github cli
brew "awscli"

brew "direnv"
cask "ngrok"

cask "kitty"
cask "rectangle"
cask "visual-studio-code"
cask "bartender" # Control your mac menu bar
cask "font-hack-nerd-font" # Add nerd font

cask "hyper"
cask "fig"

# language setup
brew "yarn", args: ["ignore-dependencies"]
brew "fnm" # node version manager

cask "vlc"
cask "figma"
cask "slack"
cask "discord"
cask "zoom"
cask "google-chrome"
cask "google-drive"
cask "fantastical"
cask "notion"

# Should install
# cask "1password"
# cask "1password-cli"
# cask "firefox"

# Keybinding
cask "hammerspoon"
cask "karabiner-elements"

# Stuff
cask "brave-browser"

# Games
cask "steam"

# Should see if really needed?
# brew "autoconf"
# brew "fish"
# brew "gawk"
# brew "gnupg"

# cask "alfred"
# cask "dash"
# cask "grid-clock"
# cask "font-ia-writer-quattro"
# cask "font-ibm-plex"
# cask "font-jetbrains-mono"

# WTF is this?
# mas "Deliveries", id: 924726344
# mas "Drafts", id: 1435957248
# mas "MindNode", id: 1289197285
# mas "Reeder", id: 1529448980
# mas "Things", id: 904280696
# mas "Tweetbot", id: 1384080005

