# vim:fileencoding=utf-8:ft=conf

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "bash"
brew "coreutils" # cat, ls, rm
brew "curl"
brew "git"
brew "neovim"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "openssl"

brew "reattach-to-user-namespace" # for tmux copy?
brew "exa" # improved ls with color
brew "fasd" #
brew "fzf"
brew "fd" # better find
brew "hub" # github commandline
brew "jq" # jq json processor
brew "mas" # mac app store command line

cask "kitty"
cask "bartender" # Control your mac menu bar
cask "font-hack-nerd-font" # Add nerd font

# Should install
# cask "1password"
# cask "1password-cli"
# cask "fantastical"
# cask "firefox"
# cask "hammerspoon"
# cask "karabiner-elements"

# Should see if really needed?
# brew "autoconf"
# brew "fish"
# brew "gawk"
# brew "gnupg"

# cask "brave-browser"
# cask "alfred"
# cask "dash"
# cask "grid-clock"
# cask "font-ia-writer-quattro"
# cask "font-ibm-plex"
# cask "font-jetbrains-mono"

# WTF is this?
# mas "Deliveries", id: 924726344
# mas "Drafts", id: 1435957248
# mas "MindNode", id: 1289197285
# mas "Reeder", id: 1529448980
# mas "Things", id: 904280696
# mas "Tweetbot", id: 1384080005

