# vim:fileencoding=utf-8:ft=conf

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "supabase/tap"

# ──────────────────────────────────────────────────────────────
# BREWS
# ──────────────────────────────────────────────────────────────

# Core shell + terminal
brew "fish"
brew "fisher"
brew "tmux"
brew "curl"
brew "wget"
brew "git"
brew "chezmoi"      # dotfile manager (replaced stow)
brew "openssl"
# brew "coreutils" # cat, ls, rm

# Modern CLI replacements
brew "exa"          # improved ls with color
brew "bat"          # smarter cat with syntax
brew "fd"           # faster, colorized find
brew "fzf"          # fuzzy search
# brew "ripgrep"

# Dev CLIs
brew "jq"                       # json processor
brew "gh"                       # github cli
brew "cloudflared"              # cloudflare tunnel daemon
brew "cloudflare-wrangler"      # cloudflare workers / pages deploy
brew "supabase/tap/supabase"    # supabase cli
# playwright — install per-project via `npm install -D playwright` (brew formula is stale)
# brew "mas"          # mac app store cli
# brew "libpq"        # postgres client
# brew "pgcli"
# brew "awscli"
# brew "golang-migrate"

# Editor
brew "neovim"
# brew "tree-sitter"
# brew "luajit", args: ["HEAD"]   # no bottle for Apple Silicon

# Node toolchain
brew "fnm"          # node version manager
brew "pnpm"         # node package manager
brew "yarn"

# Language runtimes
brew "rust"

# Media CLIs
brew "mpv"
brew "yt-dlp"

# System metrics
brew "vnstat"

# ──────────────────────────────────────────────────────────────
# CASKS
# ──────────────────────────────────────────────────────────────

# Keybinding / system tweaks
cask "hammerspoon"
cask "karabiner-elements"
cask "stats"

# Launchers / input utilities
cask "raycast"

# Terminal
cask "ghostty"

# Coding
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "docker"
cask "font-hack-nerd-font"
# cask "android-studio"
# cask "github"

# Work
cask "slack"
cask "zoom"
cask "google-chrome"
cask "google-drive"

# Messaging
cask "telegram"
# cask "discord"
# cask "messenger"
# cask "zalo" # install separate

# Notes / knowledge
cask "notion"
cask "obsidian"

# Browsers
cask "brave-browser"
# cask "firefox"
# cask "firefox-developer-edition"

# Media playback
cask "vlc"
cask "spotify"

# Screen capture / video
cask "kap"
# cask "obs"
cask "handbrake"

# Design / creative
# cask "figma"
# cask "canva"
# cask "inkscape"
# cask "darktable"
# cask "digikam" # todo: manage photo

# Office / language
# cask "adobe-acrobat-reader"
# cask "deepl"

# Finance
# cask "tradingview"

# Auth / secrets
cask "1password"
cask "1password-cli"

# Torrent / downloads
cask "qbittorrent"

# Games
cask "steam" # new age, no more dota 2 for now

# ──────────────────────────────────────────────────────────────
# DEFERRED — uncomment to install
# ──────────────────────────────────────────────────────────────
# brew "autoconf"
# brew "gawk"
# brew "gnupg"
# cask "dash"
# cask "grid-clock"
# cask "font-ia-writer-quattro"
# cask "font-ibm-plex"
# cask "font-jetbrains-mono"

# ──────────────────────────────────────────────────────────────
# MAC APP STORE
# ──────────────────────────────────────────────────────────────
# mas "Deliveries", id: 924726344
# mas "Drafts", id: 1435957248
# mas "MindNode", id: 1289197285
# mas "Reeder", id: 1529448980
# mas "Things", id: 904280696
# mas "Tweetbot", id: 1384080005
